/**
 * bitcount函数: 统计x中值为1的二进制位数
 */
int bitcount(unsigned x) 
/* {
    int b;
    for(b = 0; x != 0; x >>= 1) {
        // 每次都是比较最右边的位
        if(x & 01) {
            b++;
        }
    }
    return b;
} */
{
    int b = 0;
    while (x != 0)
    {
        x&=(x-1);
        // x = x & (x - 1)
        /**
         * 1的反码  1111 1110
         * -1的补码 1111 1111
         * 比如x是. 0010 0100
         * +       0010 0011
         * & x     0010 0100
         *         0010 0000 每一次都会消去最右边的1
         */
        b++;
    }
    return b;
}